; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v7)
             (pred_7 ?v1 ?v3)
             (pred_1 ?v9 ?v3)
             (pred_5 ?v11 ?v9 )
	     (pred_11 ?v9)
             (pred_3 ?v12)
             (pred_8 ?v1)
             (pred_12 ?v3)
             (pred_2 ?v9)
             (pred_4 ?v1)
             (pred_9 ?v9)
             (pred_6 ))



(:action op_5
:parameters (?v4 ?v2 ?v5 ?v6)
:precondition (and (pred_3 ?v4) (pred_3 ?v2) (pred_8 ?v5) (pred_12 ?v6)
          (pred_10 ?v4 ?v2) (pred_7 ?v5 ?v6)
                   (pred_1 ?v2 ?v6) (pred_11 ?v4) 
                   (pred_2 ?v2) (pred_4 ?v5))
:effect (and  (pred_9 ?v2) (not (pred_2 ?v2))))


(:action op_3
:parameters (?v4 ?v10)
:precondition (and (pred_3 ?v4) (pred_3 ?v10)
               (pred_11 ?v4) (pred_10 ?v4 ?v10) (pred_9 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v4))))

(:action op_2
:parameters (?v4 ?v5)
:precondition (and (pred_3 ?v4) (pred_8 ?v5) 
                  (pred_11 ?v4) (pred_5 ?v5 ?v4) (pred_6 ))
:effect (and (pred_4 ?v5)
   (not (pred_5 ?v5 ?v4)) (not (pred_6 ))))


(:action op_4
:parameters (?v4 ?v8 ?v13)
:precondition (and (pred_3 ?v4) (pred_8 ?v8) (pred_8 ?v13)
                  (pred_11 ?v4) (pred_4 ?v13) (pred_5 ?v8 ?v4))
:effect (and (pred_4 ?v8) (pred_5 ?v13 ?v4)
        (not (pred_4 ?v13)) (not (pred_5 ?v8 ?v4))))

(:action op_1
:parameters (?v4 ?v5)
:precondition (and (pred_3 ?v4) (pred_8 ?v5) 
                  (pred_11 ?v4) (pred_4 ?v5))
:effect (and (pred_6 ) (pred_5 ?v5 ?v4) (not (pred_4 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_07 obj_01 obj_18 obj_19 obj_08 obj_21 obj_22 obj_04 obj_10 obj_02 obj_09 obj_17 obj_11 obj_15 obj_12
    obj_03 obj_14 obj_13
    obj_05 obj_16 obj_06
    )

    (:init
       (pred_6)

       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_01)
       (pred_3 obj_18)
       (pred_3 obj_19)
       (pred_3 obj_08)
       (pred_3 obj_21)
       (pred_3 obj_22)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_09)
       (pred_3 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_15)
       (pred_3 obj_12)
       (pred_12 obj_03)
       (pred_12 obj_14)
       (pred_12 obj_13)
       (pred_8 obj_05)
       (pred_8 obj_16)
       (pred_8 obj_06)

       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_07)
       (pred_10 obj_18 obj_22)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_19 obj_04)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_21)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_21 obj_02)
       (pred_10 obj_21 obj_22)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_22 obj_09)
       (pred_10 obj_22 obj_18)
       (pred_10 obj_22 obj_21)
       (pred_10 obj_04 obj_17)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_04 obj_19)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_02 obj_21)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_22)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_15)
       (pred_2 obj_17)
       (pred_2 obj_07)
       (pred_2 obj_09)
       (pred_1  obj_17 obj_03)
       (pred_1  obj_07 obj_14)
       (pred_1  obj_09 obj_13)
       (pred_9 obj_20)
       (pred_9 obj_01)
       (pred_9 obj_18)
       (pred_9 obj_19)
       (pred_9 obj_08)
       (pred_9 obj_21)
       (pred_9 obj_22)
       (pred_9 obj_04)
       (pred_9 obj_10)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_12)

       (pred_7  obj_05 obj_03)
       (pred_7  obj_16 obj_14)
       (pred_7  obj_06 obj_13)
       (pred_5 obj_05 obj_21)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_06 obj_19)
       (pred_11 obj_20)
    )

    (:goal (and
       (pred_5 obj_05 obj_04)
       (pred_5 obj_16 obj_22)
    ))
(:constraints
  (always (not (pred_11 obj_08)))
)
)

; plan
1. (op_3 obj_20 obj_19)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_19)
   goals met: 0 of 2
2. (op_2 obj_19 obj_06)
   deleted: (pred_5 obj_06 obj_19) (pred_6)
   added: (pred_4 obj_06)
   goals met: 0 of 2
3. (op_3 obj_19 obj_04)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_04)
   goals met: 0 of 2
4. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_06)
   added: (pred_6) (pred_5 obj_06 obj_04)
   goals met: 0 of 2
5. (op_3 obj_04 obj_10)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_10)
   goals met: 0 of 2
6. (op_3 obj_10 obj_02)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_02)
   goals met: 0 of 2
7. (op_3 obj_02 obj_21)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_21)
   goals met: 0 of 2
8. (op_2 obj_21 obj_16)
   deleted: (pred_5 obj_16 obj_21) (pred_6)
   added: (pred_4 obj_16)
   goals met: 0 of 2
9. (op_3 obj_21 obj_22)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_22)
   goals met: 0 of 2
10. (op_1 obj_22 obj_16)
   deleted: (pred_4 obj_16)
   added: (pred_6) (pred_5 obj_16 obj_22)
   goals met: 1 of 2
11. (op_3 obj_22 obj_21)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_21)
   goals met: 1 of 2
12. (op_2 obj_21 obj_05)
   deleted: (pred_5 obj_05 obj_21) (pred_6)
   added: (pred_4 obj_05)
   goals met: 1 of 2
13. (op_3 obj_21 obj_02)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_02)
   goals met: 1 of 2
14. (op_3 obj_02 obj_10)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_10)
   goals met: 1 of 2
15. (op_3 obj_10 obj_04)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_04)
   goals met: 1 of 2
16. (op_4 obj_04 obj_06 obj_05)
   deleted: (pred_4 obj_05) (pred_5 obj_06 obj_04)
   added: (pred_4 obj_06) (pred_5 obj_05 obj_04)
   goals met: 2 of 2
